
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group_rule.sgrule_main_ipv4 must be replaced
-/+ resource "aws_security_group_rule" "sgrule_main_ipv4" {
      ~ cidr_blocks              = [ # forces replacement
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change.
          ~ (sensitive value),
        ]
      ~ id                       = "sgrule-2409347673" -> (known after apply)
      ~ security_group_rule_id   = "sgr-04eb6025f8baefd0f" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # null_resource.null_ansible_main must be replaced
-/+ resource "null_resource" "null_ansible_main" {
      ~ id       = "6092333178257019971" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ansible_tree_sha" = "47321118ba0b0f21b18b6bbf7461b906b14cc7625e9c56cc110bf7fe7a28f976" -> "f81111a145866f7d6c76537d0fd04f1a58c7dcbc0d4ed8e53a6c50fa18a64e70"
            # (1 unchanged element hidden)
        }
    }

  # uptimerobot_monitor.uptimerobot_main["academiacivis"] will be updated in-place
  ~ resource "uptimerobot_monitor" "uptimerobot_main" {
      + assigned_alert_contacts     = [
          + {
              + alert_contact_id = "6819028"
              + recurrence       = 15
              + threshold        = 10
            },
        ]
        id                          = "802044455"
      ~ keyword_case_type           = "CaseInsensitive" -> "CaseSensitive"
      ~ keyword_value               = "Aviso Legal" -> "test"
        name                        = "academiacivis.es"
        # (13 unchanged attributes hidden)
    }

  # uptimerobot_monitor.uptimerobot_main["daniherranz"] will be updated in-place
  ~ resource "uptimerobot_monitor" "uptimerobot_main" {
      + assigned_alert_contacts     = [
          + {
              + alert_contact_id = "6819028"
              + recurrence       = 15
              + threshold        = 10
            },
        ]
        id                          = "802044457"
      ~ keyword_case_type           = "CaseInsensitive" -> "CaseSensitive"
      ~ keyword_value               = "Aviso Legal" -> "test"
        name                        = "daniherranz.com"
        # (13 unchanged attributes hidden)
    }

  # uptimerobot_monitor.uptimerobot_main["divisayhonor"] will be updated in-place
  ~ resource "uptimerobot_monitor" "uptimerobot_main" {
      + assigned_alert_contacts     = [
          + {
              + alert_contact_id = "6819028"
              + recurrence       = 15
              + threshold        = 10
            },
        ]
        id                          = "802044459"
      ~ keyword_case_type           = "CaseInsensitive" -> "CaseSensitive"
      ~ keyword_value               = "Aviso Legal" -> "test"
        name                        = "divisayhonor.es"
        # (13 unchanged attributes hidden)
    }

  # uptimerobot_monitor.uptimerobot_main["doctorachups"] will be updated in-place
  ~ resource "uptimerobot_monitor" "uptimerobot_main" {
      + assigned_alert_contacts     = [
          + {
              + alert_contact_id = "6819028"
              + recurrence       = 15
              + threshold        = 10
            },
        ]
        id                          = "802044456"
      ~ keyword_case_type           = "CaseInsensitive" -> "CaseSensitive"
      ~ keyword_value               = "Aviso Legal" -> "test"
        name                        = "doctorachups.com"
        # (13 unchanged attributes hidden)
    }

  # uptimerobot_monitor.uptimerobot_main["inmocorner"] will be updated in-place
  ~ resource "uptimerobot_monitor" "uptimerobot_main" {
      + assigned_alert_contacts     = [
          + {
              + alert_contact_id = "6819028"
              + recurrence       = 15
              + threshold        = 10
            },
        ]
        id                          = "802044460"
      ~ keyword_case_type           = "CaseInsensitive" -> "CaseSensitive"
      ~ keyword_value               = "Aviso Legal y Cookies" -> "test"
        name                        = "inmocorner.com"
        # (13 unchanged attributes hidden)
    }

  # uptimerobot_monitor.uptimerobot_main["taxiencarballo"] will be updated in-place
  ~ resource "uptimerobot_monitor" "uptimerobot_main" {
      + assigned_alert_contacts     = [
          + {
              + alert_contact_id = "6819028"
              + recurrence       = 15
              + threshold        = 10
            },
        ]
        id                          = "802044458"
      ~ keyword_case_type           = "CaseInsensitive" -> "CaseSensitive"
      ~ keyword_value               = "Política de Cookies" -> "test"
        name                        = "taxiencarballo.com"
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
